{
  "sections": {
    "main": {
      "type": "main-page",
      "disabled": true,
      "settings": {}
    },
    "quiz_tinh_cach_v2": {
      "type": "quiz-v2",
      "blocks": {
        "question_1": {
          "type": "question",
          "settings": {
            "question_text": "Câu 1: Việc đầu tiên anh em làm khi sửa soạn vào buổi sáng là gì?",
            "answer_a": "Mặc quần.",
            "answer_b": "Mặc áo.",
            "answer_c": "Mặc kệ quần áo, đeo trang sức trước.",
            "answer_d": "Vuốt tóc.",
            "weight_a": "A",
            "weight_b": "B",
            "weight_c": "C",
            "weight_d": "D"
          }
        },
        "question_2": {
          "type": "question",
          "settings": {
            "question_text": "Câu 2: Khi đứng trước một mục tiêu mới, việc đầu tiên anh em nghĩ đến là gì?",
            "answer_a": "Âm thầm bắt tay vào làm từng bước nhỏ, miễn là mỗi ngày đều tiến lên.",
            "answer_b": "Làm luôn không do dự, thích cảm giác thử thách mạnh.",
            "answer_c": "Ngồi quan sát dấu hiệu - nếu cảm thấy \"đúng thời điểm\", anh mới bắt đầu.",
            "answer_d": "Lập kế hoạch chi tiết: đường đi - deadline - checklist rõ ràng rồi mới tiến hành.",
            "weight_a": "A",
            "weight_b": "B",
            "weight_c": "C",
            "weight_d": "D"
          }
        },
        "question_3": {
          "type": "question",
          "settings": {
            "question_text": "Câu 3: Nếu công việc đang bế tắc, anh em thường làm gì để thoát khỏi vòng lặp?",
            "answer_a": "Đổi góc nhìn, phân nhỏ việc ra và xử lý từng mảnh một.",
            "answer_b": "Đổi môi trường làm việc, thử một thứ mới hoàn toàn, hoặc nhảy thẳng vào hành động.",
            "answer_c": "Tĩnh tâm lại, chờ đến thời điểm thích hợp để hoàn thành công việc.",
            "answer_d": "Mổ xẻ vấn đề, dò đúng nguyên nhân và xử lý tận gốc bằng logic.",
            "weight_a": "A",
            "weight_b": "B",
            "weight_c": "C",
            "weight_d": "D"
          }
        },
        "question_4": {
          "type": "question",
          "settings": {
            "question_text": "Câu 4: Trong một nhóm bạn, anh em thường là người…",
            "answer_a": "Ít nói nhưng là kiểu người ai cũng thấy tin cậy.",
            "answer_b": "Nổi bật, nhiều năng lượng, dễ thành tâm điểm.",
            "answer_c": "Lặng lẽ để ý mọi người, là người thích hợp để bạn bè tâm sự.",
            "answer_d": "Rõ ràng - nói thẳng, nghĩ gì nói nấy, không thích lòng vòng.",
            "weight_a": "A",
            "weight_b": "B",
            "weight_c": "C",
            "weight_d": "D"
          }
        },
        "question_5": {
          "type": "question",
          "settings": {
            "question_text": "Câu 5: Khi quyết định một điều quan trọng, anh em đặt nặng yếu tố nào nhất?",
            "answer_a": "Mức độ bền vững, dài hạn.",
            "answer_b": "Cơ hội tạo bứt phá lớn.",
            "answer_c": "Cảm giác \"đúng linh cảm\".",
            "answer_d": "Sự hợp lý, tính toán và kiểm soát.",
            "weight_a": "A",
            "weight_b": "B",
            "weight_c": "C",
            "weight_d": "D"
          }
        },
        "question_6": {
          "type": "question",
          "settings": {
            "question_text": "Câu 6: Một ngày hoàn hảo của anh em sẽ diễn ra như thế nào?",
            "answer_a": "Làm được đúng những điều mình tự hứa với bản thân.",
            "answer_b": "Học được điều mới, gặp người mới, có cảm giác mình đang \"lớn lên nhanh\".",
            "answer_c": "Một ngày nhẹ nhàng, bình yên, cảm giác tinh thần được hồi phục.",
            "answer_d": "Hoàn thành một danh sách công việc sạch sẽ, gọn gàng.",
            "weight_a": "A",
            "weight_b": "B",
            "weight_c": "C",
            "weight_d": "D"
          }
        },
        "question_7": {
          "type": "question",
          "settings": {
            "question_text": "Câu 7: Khi cuộc sống ném cho anh em một biến cố bất ngờ, anh em sẽ phản ứng như thế nào?",
            "answer_a": "Giữ bình tĩnh, làm từng phần nhỏ trong tầm kiểm soát.",
            "answer_b": "Tạo một hành động mạnh để thay đổi ngay tình thế.",
            "answer_c": "Tìm điểm tựa tinh thần - một người, một vật, một ký ức để trấn an lại bản thân.",
            "answer_d": "Lập tức phân tích: chuyện này đến từ đâu, rủi ro - hướng xử lý - phương án dự phòng là gì.",
            "weight_a": "A",
            "weight_b": "B",
            "weight_c": "C",
            "weight_d": "D"
          }
        },
        "question_8": {
          "type": "question",
          "settings": {
            "question_text": "Câu 8: Điều gì khiến anh em cảm thấy mình trưởng thành hơn sau mỗi giai đoạn khó khăn?",
            "answer_a": "Nhìn lại và thấy mình kiên trì hơn, bền bỉ hơn.",
            "answer_b": "Những lần dám bước vào điều mình sợ và vượt qua nó.",
            "answer_c": "Mỗi lần tìm được sự bình yên bên trong, ngay cả lúc cuộc sống hỗn loạn nhất.",
            "answer_d": "Hiểu rõ hơn cách thế giới vận hành và biết cách chủ động giải quyết vấn đề.",
            "weight_a": "A",
            "weight_b": "B",
            "weight_c": "C",
            "weight_d": "D"
          }
        },
        "result_ca_chep": {
          "type": "result",
          "settings": {
            "result_id": "ca_chep",
            "result_title": "Cá Chép",
            "result_description": "<p>Kiểu người bền bỉ, điềm tĩnh, tin vào sức mạnh của sự tích lũy từng ngày. Anh em là người \"đi chậm nhưng không đứng yên\", phù hợp với hành trình vượt vũ môn - thăng hoa bằng nỗ lực thật sự.</p>",
            "result_image": "",
            "result_product_handle": ""
          }
        },
        "result_dai_thu": {
          "type": "result",
          "settings": {
            "result_id": "dai_thu",
            "result_title": "Đại Thụ",
            "result_description": "<p>Đây là kiểu người trưởng thành, vững chãi, không bị lay động bởi những biến động bên ngoài. Anh em tin rằng mọi thành công lâu dài đều phải bắt đầu từ gốc rễ: tư duy - kỷ luật - nền tảng sống. Một khi đã đứng vững, không ai có thể xô ngã anh em. Đại Thụ là hình tượng của sự điềm - sự sâu - và độ chín của một người đàn ông biết mình đang đi đâu.</p>",
            "result_image": "",
            "result_product_handle": ""
          }
        },
        "result_hoa_nho": {
          "type": "result",
          "settings": {
            "result_id": "hoa_nho",
            "result_title": "Hoa Nhỏ",
            "result_description": "<p>Kiểu người mềm mại mà mạnh mẽ, giàu sự tinh tế và cảm xúc. Anh em sống với trái tim luôn mở - biết cảm, biết thương, biết lắng nghe chính mình. Không ồn ào nhưng có sức ảnh hưởng lặng lẽ. Hoa Nhỏ là hình tượng của người chữa lành: càng tổn thương càng thấu hiểu, càng trải đời càng dịu dàng.</p>",
            "result_image": "",
            "result_product_handle": ""
          }
        },
        "result_chuong_ho_menh": {
          "type": "result",
          "settings": {
            "result_id": "chuong_ho_menh",
            "result_title": "Chuông Hộ Mệnh",
            "result_description": "<p>Kiểu người sống bằng trực giác, tín hiệu và những điều tinh tế mà người khác không nhìn thấy. Anh em cảm nhận cuộc đời bằng \"cách riêng\", có chiều sâu nội tâm và sự kết nối với những điều khó gọi thành lời. Chuông Hộ Mệnh là hình tượng của niềm tin vô hình – thứ giúp anh em bình an ngay cả khi cuộc đời hỗn loạn.</p>",
            "result_image": "",
            "result_product_handle": ""
          }
        },
        "result_rong": {
          "type": "result",
          "settings": {
            "result_id": "rong",
            "result_title": "Rồng",
            "result_description": "<p>Kiểu người dũng khí, thích thử thách mạnh, luôn muốn bứt phá khỏi vùng an toàn. Anh em thuộc nhóm \"đã làm thì làm lớn\", dám đương đầu, dám liều để đạt điều mình muốn. Rồng là biểu tượng của bản lĩnh và sự chuyển hóa - mỗi lần ngã là một lần anh em trưởng thành nhanh hơn người khác.</p>",
            "result_image": "",
            "result_product_handle": ""
          }
        }
      },
      "block_order": [
        "question_1",
        "question_2",
        "question_3",
        "question_4",
        "question_5",
        "question_6",
        "question_7",
        "question_8",
        "result_ca_chep",
        "result_dai_thu",
        "result_hoa_nho",
        "result_chuong_ho_menh",
        "result_rong"
      ],
      "settings": {
        "quiz_title": "Trắc Nghiệm Tính Cách",
        "quiz_description": "Khám phá tính cách của bạn qua 8 câu hỏi",
        "show_progress": true,
        "enable_restart": true
      }
    }
  },
  "order": [
    "quiz_tinh_cach_v2",
    "main"
  ]
}
